//----------------------------------------------------------------------------------------------
// 制作者：諸岡勇樹
// 制作日：2019/04/25
//----------------------------------------------------------------------------------------------
// Bossのパーツの挙動
//----------------------------------------------------------------------------------------------
// 2019/04/25：体パーツの情報
//----------------------------------------------------------------------------------------------

using UnityEngine;

public class BossParts : MonoBehaviour
{
	[SerializeField]
	public bool shouldAttack { get; private set; }		// 攻撃するかしないか
	private int attackInterval { get; set; }

	void Start()
    {
    }

    void Update()
    {
        if(shouldAttack)
		{

		}
		else if(!shouldAttack)
		{

		}
    }
}
